{
  "lessonId": "A1-1-M03-L06",
  "lessonTitle": {
    "de": "Der, die oder das?",
    "fa": "در، دی یا داس؟"
  },
  "module": 3,
  "priority": "high",
  "createdAt": "2025-12-27",
  "tasks": [
    {
      "id": "img-01",
      "type": "image",
      "stepId": "s4",
      "stepType": "new-word",
      "description": "Wooden table (der Tisch) - Modern brown wooden dining table with clean simple rectangular design, shown from a 3/4 angle to display its shape and four legs clearly. Neutral background, clear product-style photography.",
      "context": "Vocabulary: 'der Tisch' (table) - masculine noun, furniture",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "clean product photo, neutral background, clear view of furniture item"
      },
      "outputPath": "images/A1-1-M03-L06/der-tisch.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-02",
      "type": "image",
      "stepId": "s5",
      "stepType": "new-word",
      "description": "Wooden chair (der Stuhl) - Simple wooden chair with straight back and four legs, shown from 3/4 angle. Natural wood color, classic dining chair design. Clean neutral background.",
      "context": "Vocabulary: 'der Stuhl' (chair) - masculine noun, furniture",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "clean product photo, neutral background, classic furniture piece"
      },
      "outputPath": "images/A1-1-M03-L06/der-stuhl.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-03",
      "type": "image",
      "stepId": "s6",
      "stepType": "new-word",
      "description": "Modern table lamp (die Lampe) - Contemporary white or beige table lamp with cylindrical or conical shade, turned on and glowing with warm light, shown on a simple surface against neutral background.",
      "context": "Vocabulary: 'die Lampe' (lamp) - feminine noun, furniture/lighting",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "clean product photo, lamp is lit, warm glow visible, modern design"
      },
      "outputPath": "images/A1-1-M03-L06/die-lampe.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-04",
      "type": "image",
      "stepId": "s7",
      "stepType": "new-word",
      "description": "Wooden door (die Tür) - Modern interior door, slightly open, showing door handle. White or natural wood finish. Home interior context visible. Clean, minimal design.",
      "context": "Vocabulary: 'die Tür' (door) - feminine noun, house element",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "interior photography, modern home design, clear door visible"
      },
      "outputPath": "images/A1-1-M03-L06/die-tuer.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-05",
      "type": "image",
      "stepId": "s8",
      "stepType": "new-word",
      "description": "Modern bed (das Bett) - Double bed with white or cream bedding, wooden or upholstered frame, shown from side angle with headboard visible. Clean, new-looking bed with neat sheets and pillows. Bedroom setting.",
      "context": "Vocabulary: 'das Bett' (bed) - neuter noun, furniture",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "clean product photo, bedroom furniture, inviting and neat, modern design"
      },
      "outputPath": "images/A1-1-M03-L06/das-bett.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-06",
      "type": "image",
      "stepId": "s9",
      "stepType": "new-word",
      "description": "Modern sofa/couch (das Sofa) - Comfortable gray or beige modern sofa, 2-3 seater, shown from front angle displaying its full length. Cushions arranged nicely. Contemporary home design, comfortable appearance.",
      "context": "Vocabulary: 'das Sofa' (sofa/couch) - neuter noun, furniture",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "clean product photo, comfortable inviting furniture, neutral background, modern style"
      },
      "outputPath": "images/A1-1-M03-L06/das-sofa.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-07",
      "type": "image",
      "stepId": "s10",
      "stepType": "new-word",
      "description": "Modern window (das Fenster) - Large rectangular window with view of sky or outdoors, white or wood frame, shown from interior perspective. Clean glass, natural light coming through. Modern home setting.",
      "context": "Vocabulary: 'das Fenster' (window) - neuter noun, house element",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "interior photography, natural light, modern home design, clean view"
      },
      "outputPath": "images/A1-1-M03-L06/das-fenster.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-08",
      "type": "image",
      "stepId": "s17",
      "stepType": "grammar-tip",
      "description": "Three genders educational diagram. Three columns with color coding: Column 1 (blue) = MASKULIN / der (Tisch, Stuhl), Column 2 (red) = FEMININ / die (Lampe, Tür), Column 3 (green) = NEUTRAL / das (Bett, Sofa, Fenster). Include warning symbol with text: 'Gender is grammatical, NOT biological! Example: das Mädchen (neuter) = girl'. Use icons or simple furniture illustrations.",
      "context": "Grammar tip: Three grammatical genders in German (der/die/das system)",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "educational diagram, three-column layout, color-coded, clear visual distinction, warning callout"
      },
      "outputPath": "images/A1-1-M03-L06/three-genders-system.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "CRITICAL concept - foundation of German noun system. Must be extremely clear."
    },
    {
      "id": "img-09",
      "type": "image",
      "stepId": "s18",
      "stepType": "grammar-tip",
      "description": "Gender learning patterns infographic. Three sections showing common patterns: 1) DER patterns: days (Montag), months (Januar), seasons (Sommer) with calendar icons. 2) DIE patterns: numbers (die Eins), words ending -ung/-heit/-keit with examples. 3) DAS patterns: words ending -chen/-lein (Mädchen, Fräulein), letters of alphabet (das A). Use icons and visual mnemonics. Include large text: 'ALWAYS learn nouns WITH their article!'",
      "context": "Grammar tip: Patterns and rules for predicting gender - learning strategies",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "educational infographic, pattern recognition, visual mnemonics, memorable icons, study tips"
      },
      "outputPath": "images/A1-1-M03-L06/gender-patterns.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Practical learning tool - helps students predict and memorize genders"
    },
    {
      "id": "img-10",
      "type": "image",
      "stepId": "s19",
      "stepType": "dialog",
      "description": "Interior of modern furniture store. Female salesperson (Verkäuferin) in professional attire and male customer standing near display of wooden table and modern lamp. Customer pointing at or examining table while salesperson gestures welcomingly. Store has warm lighting with various furniture pieces visible in background. Price tags visible on items.",
      "context": "Dialog: Furniture store shopping scene - asking about prices using der/die articles",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "modern furniture store, warm lighting, professional retail environment, clear product display"
      },
      "outputPath": "images/A1-1-M03-L06/furniture-store-dialog.jpg",
      "status": "pending",
      "assignee": null,
      "notes": ""
    },
    {
      "id": "img-11",
      "type": "image",
      "stepId": "s25",
      "stepType": "grammar-tip",
      "description": "German furniture shopping cultural infographic. Four sections with icons: 1) Unfurnished apartments - empty room illustration with text 'Wohnung ohne Möbel'. 2) IKEA popularity - IKEA logo/building with shopping cart, text about most popular furniture store. 3) No kitchen - empty kitchen space with text 'Oft ohne Küche'. 4) Transportation - truck/van icon with text 'Selbst abholen' (pick up yourself). Include practical tip: 'Plan furniture budget when moving to Germany!'",
      "context": "Cultural note: Furniture shopping in Germany - unfurnished apartments, IKEA culture, DIY transport",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "cultural infographic, practical information, icons and illustrations, helpful for newcomers"
      },
      "outputPath": "images/A1-1-M03-L06/furniture-shopping-culture.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Very practical for Iranian students moving to Germany - important cultural preparation"
    },
    {
      "id": "vid-01",
      "type": "video",
      "stepId": "s19",
      "stepType": "dialog",
      "description": "Furniture store scene. Verkäuferin greets Kunde. Dialog: Verkäuferin: 'Guten Tag! Kann ich Ihnen helfen?' - Kunde: 'Ja, wie viel kostet der Tisch?' - Verkäuferin: 'Der Tisch kostet 199 Euro. Er ist sehr schön, oder?' - Kunde: 'Ja, er ist schön. Und die Lampe?' - Verkäuferin: 'Die Lampe kostet 45 Euro. Sie ist neu.' Customer examines furniture, salesperson is helpful and professional. Emphasize der/die articles when speaking.",
      "context": "Complete furniture shopping dialog demonstrating gender articles in practical context",
      "specs": {
        "duration": "25-30 seconds",
        "format": "mp4",
        "resolution": "1080p",
        "audio": "Clear German pronunciation, polite professional tone, emphasize articles (der/die)"
      },
      "outputPath": "videos/A1-1-M03-L06/furniture-store-dialog.mp4",
      "status": "pending",
      "assignee": null,
      "notes": "CRITICAL: Actors should slightly emphasize the articles (der Tisch, die Lampe) so learners hear the gender clearly. Natural gestures toward furniture items."
    }
  ],
  "summary": {
    "totalTasks": 12,
    "images": 11,
    "videos": 1,
    "priority": "HIGHEST priority: Three genders diagram (img-08) and gender patterns infographic (img-09) - these are foundational concepts for German language learning. Furniture vocabulary images help concrete memorization with genders. Cultural shopping info is practically valuable for students."
  }
}
