{
  "lessonId": "A1-2-M04-L08",
  "lessonTitle": {
    "de": "Essen & Trinken",
    "fa": "غذا و نوشیدنی"
  },
  "module": 4,
  "priority": "high",
  "createdAt": "2025-12-27",
  "tasks": [
    {
      "id": "img-01",
      "type": "image",
      "stepId": "s3",
      "stepType": "new-word",
      "description": "Cup of coffee on a table. White ceramic coffee cup with saucer, steaming hot coffee with crema on top. Café setting with wooden table. Warm lighting, inviting atmosphere. Coffee beans scattered nearby.",
      "context": "Vocabulary: der Kaffee - coffee, common German beverage",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "warm café atmosphere, appetizing presentation, natural lighting"
      },
      "outputPath": "images/A1-2-M04-L08/kaffee.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "German coffee culture is important - show quality coffee"
    },
    {
      "id": "img-02",
      "type": "image",
      "stepId": "s6",
      "stepType": "new-word",
      "description": "Traditional German bread (Brot) display. Various types of German bread loaves - dark rye bread (Vollkornbrot), crusty bread rolls (Brötchen), sliced bread. Bakery setting with wicker baskets. Warm golden brown colors, artisanal quality bread.",
      "context": "Vocabulary: das Brot - bread, staple of German cuisine",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "bakery setting, warm colors, variety of traditional German breads"
      },
      "outputPath": "images/A1-2-M04-L08/brot.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Show variety of German bread types - important cultural element"
    },
    {
      "id": "img-03",
      "type": "image",
      "stepId": "s7",
      "stepType": "new-word",
      "description": "Cheese platter with various German cheeses. Selection of cheese pieces including Swiss cheese with holes, soft cheese, hard cheese. Wooden cutting board presentation. Cheese knife visible. Appetizing arrangement with some grapes as garnish.",
      "context": "Vocabulary: der Käse - cheese, common food item",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "appetizing food photography, natural lighting, wooden board presentation"
      },
      "outputPath": "images/A1-2-M04-L08/kaese.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Show quality German/Swiss cheese varieties"
    },
    {
      "id": "img-04",
      "type": "image",
      "stepId": "s8",
      "stepType": "new-word",
      "description": "Bowl of soup on a table. Hot vegetable soup (Gemüsesuppe) in a white bowl, steam rising. Colorful vegetables visible - carrots, potatoes, herbs. Spoon beside bowl. Restaurant table setting with bread on the side. Warm, comforting presentation.",
      "context": "Vocabulary: die Suppe - soup, common German dish",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "restaurant setting, warm lighting, appetizing steaming soup"
      },
      "outputPath": "images/A1-2-M04-L08/suppe.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Show warmth and comfort of soup"
    },
    {
      "id": "img-05",
      "type": "image",
      "stepId": "s17",
      "stepType": "grammar-tip",
      "description": "Modal verb möchten conjugation table. Clean educational table showing: ich möchte, du möchtest, er/sie möchte, wir möchten, ihr möchtet, sie/Sie möchten. Below: comparison showing 'möchten' (polite) vs 'wollen' (direct) with checkmark on möchten for restaurant situations. Example sentences.",
      "context": "Grammar: Polite modal verb möchten for ordering food",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "educational table, clear typography, comparison chart, color-coded politeness levels"
      },
      "outputPath": "images/A1-2-M04-L08/moechten-conjugation.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Emphasize politeness aspect - important for restaurant situations"
    },
    {
      "id": "img-06",
      "type": "image",
      "stepId": "s18",
      "stepType": "grammar-tip",
      "description": "Akkusativ case table for food ordering. Table showing Nominativ to Akkusativ changes: der Kaffee → einen Kaffee, die Suppe → eine Suppe, das Brot → ein Brot. Highlight showing only MASCULINE changes (ein → einen). Visual arrows showing transformation. Example sentences: 'Ich möchte einen Salat.'",
      "context": "Grammar: Accusative case when ordering food - only masculine changes",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "educational diagram, color-coded by gender, arrows showing changes, clear emphasis on masculine"
      },
      "outputPath": "images/A1-2-M04-L08/akkusativ-essen.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Critical grammar point - only masculine articles change in accusative"
    },
    {
      "id": "img-07",
      "type": "image",
      "stepId": "s25",
      "stepType": "grammar-tip",
      "description": "Cultural infographic: Kaffee und Kuchen tradition. Split image showing: clock at 3-4 PM, slice of cake (Torte/Kuchen), coffee cup. Family gathering around café table on Sunday afternoon. Tipping guide: '5-10% Trinkgeld' with coin icons. Speech bubble saying 'Stimmt so!' Text explaining 'getrennt zahlen' (split bill) custom.",
      "context": "Cultural note: German coffee and cake tradition, tipping customs",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "infographic style, warm family atmosphere, cultural icons, practical tipping information"
      },
      "outputPath": "images/A1-2-M04-L08/kaffee-kuchen-kultur.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Important cultural differences for Persian speakers - separate bills, tipping"
    },
    {
      "id": "img-08",
      "type": "image",
      "stepId": "s19",
      "stepType": "dialog",
      "description": "Restaurant scene with waiter and customer. Professional waiter (Kellner) in white shirt taking order from seated customer. Customer pointing at menu. Modern casual restaurant interior. Both appear friendly and professional. Menu visible on table.",
      "context": "Dialog: Ordering food in a restaurant using möchten",
      "specs": {
        "dimensions": "800x600",
        "format": "jpg",
        "style": "restaurant interior, professional service atmosphere, natural interaction"
      },
      "outputPath": "images/A1-2-M04-L08/restaurant-bestellen.jpg",
      "status": "pending",
      "assignee": null,
      "notes": "Show professional but friendly restaurant service"
    },
    {
      "id": "vid-01",
      "type": "video",
      "stepId": "s19",
      "stepType": "dialog",
      "description": "Restaurant ordering scene. Waiter approaches customer's table. Dialog: Kellner: 'Guten Tag! Möchten Sie bestellen?' - Gast: 'Ja, ich möchte eine Suppe und einen Salat, bitte.' - Kellner: 'Gern. Und was möchten Sie trinken?' - Gast: 'Ein Glas Wasser, bitte.' - Kellner: 'Sehr gern. Kommt sofort!' Professional gestures, waiter writes order, customer pointing at menu.",
      "context": "Complete restaurant dialog demonstrating möchten and accusative case",
      "specs": {
        "duration": "20-25 seconds",
        "format": "mp4",
        "resolution": "1080p",
        "audio": "Clear German pronunciation, professional polite tone, moderate pace"
      },
      "outputPath": "videos/A1-2-M04-L08/restaurant-dialog.mp4",
      "status": "pending",
      "assignee": null,
      "notes": "Show professional service interaction. Emphasize clear pronunciation of einen vs eine."
    }
  ],
  "summary": {
    "totalTasks": 9,
    "images": 8,
    "videos": 1,
    "priority": "Focus on Akkusativ grammar diagram (masculine change) and möchten conjugation. Cultural Kaffee und Kuchen image important."
  }
}
